{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [128, 1]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [1]}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "embedding_1/embeddings", "dtype": "float32", "shape": [7, 128]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "gru_1/kernel", "dtype": "float32", "shape": [128, 384]}, {"name": "gru_1/recurrent_kernel", "dtype": "float32", "shape": [128, 384]}, {"name": "gru_1/bias", "dtype": "float32", "shape": [384]}]}], "modelTopology": {"training_config": {"loss_weights": null, "loss": "binary_crossentropy", "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "epsilon": 1e-07, "decay": 0.0, "amsgrad": false, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513}}, "metrics": ["accuracy"]}, "keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "embeddings_constraint": null, "output_dim": 128, "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_length": 80, "dtype": "float32", "activity_regularizer": null, "input_dim": 7, "batch_input_shape": [null, 80]}}, {"class_name": "GRU", "config": {"name": "gru_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "dropout": 0.2, "go_backwards": false, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "trainable": true, "activation": "tanh", "recurrent_constraint": null, "use_bias": true, "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "units": 128, "bias_constraint": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 1, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}]}}}